{"booksData":[
  {"id":1,
    "title":"The Hobbit",
    "author":"J.R.R. Tolkien",
    "bookCover":"https://img4.labirint.ru/rc/af070b7c9cf67ef38a062416f557d092/220x340/books42/417700/cover.jpg?1612949105",
    "publicationDate":1937,
    "annotation":"The Hobbit is set within Tolkien's fictional universe and follows the quest of home-loving Bilbo Baggins, the titular hobbit, to win a share of the treasure guarded by Smaug the dragon. Bilbo's journey takes him from light-hearted, rural surroundings into more sinister territory.",
    "completed":false,
    "completedDate":null
  },
  {"id":2,
    "title":"A Hat Full of Sky",
    "author":"Terry Pratchett",
    "bookCover":"https://img3.labirint.ru/rc/0615c36029224eb41f0d875a3c09de49/220x340/books53/527231/cover.jpg?1563899246",
    "publicationDate":2004,
    "annotation":"A Hat Full of Sky by Terry Pratchett is a fantasy novel about a girl who is learning her place as a witch. Early in the novel, Tiffany Aching leaves  her home in the chalk country (based on England's chalk country) to act as an apprentice and maid for the elderly witch Miss Level ",
    "completed":false,
    "completedDate":null
  },
  {"id":3,
    "title":"Nine Princes in Amber",
    "author":"Rodger Zelazny",
    "bookCover":"https://img3.labirint.ru/rc/5add382db72e777cc515994089430cfa/220x340/books15/143693/cover.jpg?1612369518",
    "publicationDate":1970,
    "annotation":"Carl Corey wakes in a medical clinic, with little to no knowledge of who he is or how he got there. He suspects he is being over-medicated, so he overpowers the nurse and doctor and escapes his room. He finds the manager of the clinic, and learns that he was recovering from a car accident in a private clinic, paid for by his sister, Evelyn Flaumel.",
    "completed":false,
    "completedDate":null
  },
  {
    "id":4,
    "title":"The Last Wish",
    "author":"Andrzej Sapkowski",
    "bookCover":"https://img3.labirint.ru/rc/9fd928f6434d8adbade2e0d5994922a9/220x340/books58/571931/cover.png?1613741122",
    "publicationDate":1993,
    "annotation":"Geralt of Rivia is a witcher. A cunning sorcerer. A merciless assassin.nAnd a cold-blooded killer.His sole purpose: to destroy the monsters that plague the world.",
    "completed":true,
    "completedDate":null,
    "currentStatus": "completed"
  },
  {
    "id":5,
    "title":"Кишот",
    "author":"Салман Рушди",
    "bookCover":"https://img4.labirint.ru/rc/9a3b69358dec669d5cf9517ba0eaf99b/220x340/books83/820762/cover.jpg?1630661108",
    "publicationDate":2019,
    "annotation":"Сэм Дюшан, сочинитель шпионских романов, вдохновленный бессмертным шедевром Сервантеса, придумывает своего Дон Кихота - пожилого торговца Кишота, настоящего фаната телевидения, влюбленного в телезвезду. Вместе со своим (воображаемым) сыном Санчо Кишот пускается в полное авантюр странствие по Америке, чтобы доказать, что он достоин благосклонности своей возлюбленной.",
    "completed":false,
    "completedDate":null
  },
  {
    "id":6,
    "title":"Transhumanism inc.",
    "author":"Виктор Пелевин",
    "bookCover":"https://img3.labirint.ru/rc/c246d5f5b9e5cc336d44990f54bb59fc/220x340/books82/815423/cover.jpg?1630049102",
    "publicationDate":2021,
    "annotation":"В будущем богатые люди смогут отделить свой мозг от старящегося тела - и станут жить почти вечно в особом \"баночном\" измерении. Туда уйдут вожди, мировые олигархи и архитекторы миропорядка. Там будет возможно все.\n\n Но в банку пустят не каждого. На земле останется зеленая посткарбоновая цивилизация, уменьшенная до размеров обслуживающего персонала, и слуги-биороботы.",
    "completed":false,
    "completedDate":null
  }
]}